public class Main {
    /*
    * 1) Создать и запустить программу для построения двоичного дерева.
    * В цикле построить двадцать деревьев с глубиной в 6 уровней.
    * Данные, которыми необходимо заполнить узлы деревьев, представляются в виде чисел типа int.
    * Число, которое попадает в узел, должно генерироваться случайным образом в диапазоне от -100 до 100.
    * 2)Проанализировать, какой процент созданных деревьев являются несбалансированными.
*  */
    public static void main(String[] args) {
/*        MyTree<Integer, String> map = new MyTree<>();

        map.put(4, "four");
        map.put(2, "two");
        map.put(1, "one");
        map.put(5, "five");
        map.put(3, "three");

//        System.out.println(map.size());
//        System.out.println(map.get(2));
//        map.put(2, "two two");
//        System.out.println(map.get(2));

        System.out.println(map);

        map.delete(1);
        System.out.println(map);*/

    }
}
